cmsis-svd/cmsis-svd/data/SiliconLabs/SIM3U1x6_SVD.xml
				<register>
					<name>CONTROL</name>
					<description>Measurement Control</description>
					<addressOffset>0x10</addressOffset>
					<resetValue>0x1008F078</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>REFGNDSEL</name>
							<description>Reference Ground Select. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>INTERNAL</name>
									<description>The internal device ground is used as the ground reference for ADC conversions.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXTERNAL</name>
									<description>The VREFGND pin is used as the ground reference for ADC conversions.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKESEL</name>
							<description>Sampling Clock Edge Select. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>RISING</name>
									<description>Select the rising edge of the APB clock.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALLING</name>
									<description>Select the falling edge of the APB clock.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BMTK</name>
							<description>Burst Mode Tracking Time. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>SCSEL</name>
							<description>Start-Of-Conversion Source Select. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ADCNT0</name>
									<description>An ADC conversion triggers from the ADCnT0 (&quot;On Demand&quot; by writing 1 to ADBUSY) trigger source.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCNT1</name>
									<description>An ADC conversion triggers from the ADCnT1 (Timer 0 Low Overflow) trigger source.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCNT2</name>
									<description>An ADC conversion triggers from the ADCnT2 (Timer 0 High Overflow) trigger source.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCNT3</name>
									<description>An ADC conversion triggers from the ADCnT3 (Timer 1 Low Overflow) trigger source.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCNT4</name>
									<description>An ADC conversion triggers from the ADCnT4 (Timer 1 High Overflow) trigger source.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCNT5</name>
									<description>An ADC conversion triggers from the ADCnT5 (EPCA0 synchronization pulse) trigger source.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCNT6</name>
									<description>An ADC conversion triggers from the ADCnT6 (I2C0 Timer overflow) trigger source.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCNT7</name>
									<description>An ADC conversion triggers from the ADCnT7 (I2C1 Timer overflow) trigger source.</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCNT8</name>
									<description>An ADC conversion triggers from the ADCnT8 (SSG phase defined by ADSP bits) trigger source.</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCNT9</name>
									<description>An ADC conversion triggers from the ADCnT9 (RESERVED) trigger source.</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCNT10</name>
									<description>An ADC conversion triggers from the ADCnT10 (RESERVED) trigger source.</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCNT11</name>
									<description>An ADC conversion triggers from the ADCnT11 (RESERVED) trigger source.</description>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCNT12</name>
									<description>An ADC conversion triggers from the ADCnT12 (RESERVED) trigger source.</description>
									<value>12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCNT13</name>
									<description>An ADC conversion triggers from the ADCnT13 (RESERVED) trigger source.</description>
									<value>13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCNT14</name>
									<description>An ADC conversion triggers from the ADCnT14 (RESERVED) trigger source.</description>
									<value>14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCNT15</name>
									<description>An ADC conversion triggers from the ADCnT15 (PB1.7) trigger source.</description>
									<value>15</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWRTIME</name>
							<description>Burst Mode Power Up Time. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>BURSTEN</name>
							<description>Burst Mode Enable. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable burst mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable burst mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADCEN</name>
							<description>ADC Enable. </description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the ADC (low-power shutdown).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the ADC (active and ready for data conversions).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AD12BSSEL</name>
							<description>12-Bit Mode Sample Select. </description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>FOUR</name>
									<description>The ADC re-samples the input before each of the four conversions.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ONE</name>
									<description>The ADC samples once before the first conversion and converts four times.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCMEN</name>
							<description>Common Mode Buffer Enable. </description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the common mode buffer.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the common mode buffer.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ACCMD</name>
							<description>Accumulation Mode. </description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ACCUMULATE</name>
									<description>Conversions will be accumulated for the specified number of cycles in burst mode according to the channel configuration.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>REPEAT</name>
									<description>Conversions will not be accumulated in burst mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TRKMD</name>
							<description>ADC Tracking Mode. </description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>Normal Tracking Mode: When the ADC is enabled, a conversion begins immediately following the start-of-conversion signal.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DELAYED</name>
									<description>Delayed Tracking Mode: When the ADC is enabled, a conversion begins 3 SAR clock cycles following the start-of-conversion signal. The ADC is allowed to track during this time.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADBUSY</name>
							<description>ADC Busy. </description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BIASSEL</name>
							<description>Bias Power Select. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>MODE0</name>
									<description>Select bias current mode 0. Recommended to use modes 1, 2, or 3.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE1</name>
									<description>Select bias current mode 1 (SARCLK = 16 MHz).</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE2</name>
									<description>Select bias current mode 2.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE3</name>
									<description>Select bias current mode 3 (SARCLK = 4 MHz).</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LPMDEN</name>
							<description>Low Power Mode Enable. </description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable low power mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable low power mode (requires extended tracking time).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MREFLPEN</name>
							<description>MUX and VREF Low Power Enable. </description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable low power mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable low power mode (SAR clock &lt;= 4 MHz).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VREFSEL</name>
							<description>Voltage Reference Select. </description>
							<bitOffset>30</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>INTERNAL_VREF</name>
									<description>Select the internal, dedicated SARADC voltage reference as the ADC reference.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VDD</name>
									<description>Select the VDD pin as the ADC reference.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LDO_OUT</name>
									<description>Select the output of the internal LDO regulator (~1.8 V) as the ADC reference.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXTERNAL_VREF</name>
									<description>Select the VREF pin as the ADC reference. This option is used for either an external VREF or the on-chip VREF driving out to the VREF pin.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
