cmsis-svd/cmsis-svd/data/SiliconLabs/SIM3U1x6_SVD.xml
				<register>
					<name>CONTROL_2</name>
					<description>Channel Capture/Compare Control</description>
					<addressOffset>0x90</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>COUTST</name>
							<description>Channel Output State. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>The channel output state is low.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>The channel output state is high.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CPCAPEN</name>
							<description>Positive Edge Input Capture Enable. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable positive-edge input capture.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable positive-edge input capture.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNCAPEN</name>
							<description>Negative Edge Input Capture Enable. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable negative-edge input capture.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable negative-edge input capture.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CUPDCF</name>
							<description>Channel Register Update Complete Flag. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>A EPCA channel register update completed or is not pending.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>A EPCA channel register update has not completed and is still pending.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>YPHST</name>
							<description>Differential Y Phase State. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Set the Y Phase output state to low.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Set the Y Phase output state to high.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ACTIVEPH</name>
							<description>Active Channel Select. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>YACTIVE</name>
									<description>The Y Phase is active and X Phase is inactive.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>XACTIVE</name>
									<description>The X Phase is active and Y Phase is inactive.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>XPHST</name>
							<description>Differential X Phase State. </description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Set the X Phase output state to low.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Set the X Phase output state to high.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CCIEN</name>
							<description>Capture/Compare Interrupt Enable. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the channel capture/compare interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the channel capture/compare interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CCDEN</name>
							<description>Capture/Compare DMA Request Enable. </description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Do not request DMA data when a channel capture/compare event occurs.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Request DMA data when a channel capture/compare event occurs.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CCSEN</name>
							<description>Capture/Compare Synchronization Signal Enable. </description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Do not send a synchronization signal when a channel capture/compare event occurs.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Send a synchronization signal when a channel capture/compare event occurs.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CIOVFIEN</name>
							<description>Intermediate Overflow Interrupt Enable. </description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the channel intermediate overflow interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the channel intermediate overflow interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CIOVFDEN</name>
							<description>Intermediate Overflow DMA Request Enable. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Do not request DMA data when a channel intermediate overflow event occurs.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Request DMA data when a channel intermediate overflow event occurs.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CIOVFSEN</name>
							<description>Intermediate Overflow Synchronization Signal Enable. </description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Do not send a synchronization signal when a channel intermediate overflow event occurs.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Send a synchronization signal when a channel intermediate overflow occurs.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CCAPV_2</name>
					<description>Channel Compare Value</description>
					<addressOffset>0xa0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CCAPV</name>
							<description>Channel Compare Value. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>18</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CCAPVUPD_2</name>
					<description>Channel Compare Update Value</description>
					<addressOffset>0xb0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CCAPVUPD</name>
							<description>Channel Compare Update Value. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>18</bitWidth>
						</field>
					</fields>
				</register>
