cmsis-svd/cmsis-svd/data/SiliconLabs/SIM3U1x6_SVD.xml
									<description>Lock the External Regulator (EXTVREG0) Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IVCL</name>
							<description>IVC Module Lock Enable. </description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the IVC0 Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the IVC0 Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PERIPHLOCK1</name>
					<description>Peripheral Lock Control 1</description>
					<addressOffset>0x40</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PMUL</name>
							<description>PMU Module Lock Enable. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Unlock the PMU Module registers.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Lock the PMU Module registers (bits can still be read).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>LPTIMER_0</name>
			<version>A</version>
			<description>None</description>
			<groupName>LPTIMER_0</groupName>
			<baseAddress>0x40038000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>LPTIMER0_IRQn</name>
				<value>50</value>
			</interrupt>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>CONTROL</name>
					<description>Module Control</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CMD</name>
							<description>Count Mode. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>FREE</name>
									<description>The timer is free running mode on the RTCn module clock (RTCnOSC or LFOSCn).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISING_EDGE</name>
									<description>The timer is incremented on the rising edges of the selected external trigger (LPTnTx).</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALLING_EDGE</name>
									<description>The timer is incremented on the falling edges of the selected external trigger (LPTnTx).</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ANY_EDGE</name>
									<description>The timer is incremented on both edges of the selected external trigger (LPTnTx).</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXTSEL</name>
							<description>External Trigger Source Select. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LPTNT0</name>
									<description>Select external trigger LPTnT0 (PB3.2).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LPTNT1</name>
									<description>Select external trigger LPTnT1 (PB3.8).</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LPTNT2</name>
									<description>Select external trigger LPTnT2 (PB3.9).</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LPTNT3</name>
									<description>Select external trigger LPTnT3 (Comparator 0 Output).</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LPTNT4</name>
									<description>Select external trigger LPTnT4 (RESERVED).</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LPTNT5</name>
									<description>Select external trigger LPTnT5 (RESERVED).</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LPTNT6</name>
									<description>Select external trigger LPTnT6 (RESERVED).</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LPTNT7</name>
									<description>Select external trigger LPTnT7 (RESERVED).</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LPTNT8</name>
									<description>Select external trigger LPTnT8 (RESERVED).</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LPTNT9</name>
									<description>Select external trigger LPTnT9 (RESERVED).</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LPTNT10</name>
									<description>Select external trigger LPTnT10 (RESERVED).</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LPTNT11</name>
									<description>Select external trigger LPTnT11 (RESERVED).</description>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LPTNT12</name>
									<description>Select external trigger LPTnT12 (RESERVED).</description>
									<value>12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LPTNT13</name>
									<description>Select external trigger LPTnT13 (RESERVED).</description>
									<value>13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LPTNT14</name>
									<description>Select external trigger LPTnT14 (RESERVED).</description>
									<value>14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LPTNT15</name>
									<description>Select external trigger LPTnT15 (RESERVED).</description>
									<value>15</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TMRSET</name>
							<description>Timer Set. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>SET</name>
									<description>Writing a 1 to TMRSET initiates a copy of the value from the DATA register into the internal timer register. This field is automatically cleared by hardware when the copy is complete and does not need to be cleared by software.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TMRCAP</name>
							<description>Timer Capture. </description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>SET</name>
									<description>Writing a 1 to TMRCAP initiates a read of internal timer register into the DATA register. This field is automatically cleared by hardware when the operation completes and does not need to be cleared by software.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMPSET</name>
							<description>Timer Comparator Set. </description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>SET</name>
									<description>Writing a 1 to CMPSET initiates a copy of the value in DATA into the internal timer comparator register. This field is automatically cleared by hardware when the copy is complete and does not need to be cleared by software.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMPCAP</name>
							<description>Timer Comparator Capture. </description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>SET</name>
									<description>Writing a 1 to CMPCAP initiates a read of the internal comparator register into the DATA register. This field is automatically cleared by hardware when the operation completes and does not need to be cleared by software.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OVFIEN</name>
							<description>Timer Overflow Interrupt Enable. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the timer overflow interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the timer overflow interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMPIEN</name>
							<description>Timer Compare Event Interrupt Enable. </description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the timer compare event interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the timer compare event interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OVFTMD</name>
							<description>Timer Overflow Toggle Mode. </description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Timer overflows do not toggle the Low Power Timer output.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Timer overflows toggle the Low Power Timer output.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMPTMD</name>
							<description>Timer Compare Event Toggle Mode . </description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Timer compare events do not toggle the Low Power Timer output.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Timer compare events toggle the Low Power Timer output.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMPRSTEN</name>
							<description>Timer Compare Event Reset Enable. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Timer compare events do not reset the timer.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Timer compare events reset the timer.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DBGMD</name>
							<description>Low Power Timer Debug Mode. </description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>RUN</name>
									<description>The Low Power Timer module will continue to operate while the core is halted in debug mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HALT</name>
									<description>A debug breakpoint will cause the Low Power Timer module to halt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RUN</name>
							<description>Timer Run Control and Compare Threshold Enable. </description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>STOP</name>
									<description>Stop the timer and disable the compare threshold.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>START</name>
									<description>Start the timer running and enable the compare threshold.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DATA</name>
					<description>Timer and Comparator Data</description>
					<addressOffset>0x10</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DATA</name>
							<description>Timer and Comparator Data. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUS</name>
					<description>Module Status</description>
					<addressOffset>0x20</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>OVFI</name>
							<description>Timer Overflow Interrupt Flag. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>A timer overflow has not occurred.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>A timer overflow occurred.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMPI</name>
							<description>Timer Compare Event Interrupt Flag. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>A timer compare event has not occurred.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>A timer compare event occurred.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
