cmsis-svd/cmsis-svd/data/SiliconLabs/SIM3U1x6_SVD.xml
				<register>
					<name>CMINTEPE</name>
					<description>Common Interrupt and Endpoint Control</description>
					<addressOffset>0x50</addressOffset>
					<resetValue>0x001F0006</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SUSIEN</name>
							<description>Suspend Interrupt Enable. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the Suspend interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the Suspend interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESIEN</name>
							<description>Resume Interrupt Enable. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the Resume interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the Resume interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RSTIEN</name>
							<description>Reset Interrupt Enable. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the Reset interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the Reset interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SOFIEN</name>
							<description>Start of Frame Interrupt Enable. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the SOF interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the SOF interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EP0EN</name>
							<description>Endpoint 0 Enable. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable Endpoint 0 (no NACK, ACK, or STALL on the USB network).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable Endpoint 0 (normal).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EP1EN</name>
							<description>Endpoint 1 Enable. </description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable Endpoint 1 (no NACK, ACK, or STALL on the USB network).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable Endpoint 1 (normal).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EP2EN</name>
							<description>Endpoint 2 Enable. </description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable Endpoint 2 (no NACK, ACK, or STALL on the USB network).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable Endpoint 2 (normal).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EP3EN</name>
							<description>Endpoint 3 Enable. </description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable Endpoint 3 (no NACK, ACK, or STALL on the USB network).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable Endpoint 3 (normal).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EP4EN</name>
							<description>Endpoint 4 Enable. </description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable Endpoint 4 (no NACK, ACK, or STALL on the USB network).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable Endpoint 4 (normal).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CRCONTROL</name>
					<description>Clock Recovery Control</description>
					<addressOffset>0x60</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>OLEN</name>
							<description>Oscillator Open-Loop Mode Enable. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Do not freeze the USB oscillator output frequency (closed loop mode).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Freeze the USB oscillator output frequency (open loop mode).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LSCRMD</name>
							<description>Low Speed Clock Recovery Mode. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>FULL_SPEED</name>
									<description>Full Speed Mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOW_SPEED</name>
									<description>Low Speed Mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CRSSEN</name>
							<description>Clock Recovery Single Step Enable. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Normal calibration mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Single step mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CREN</name>
							<description>Clock Recovery Enable. </description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable clock recovery.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable clock recovery.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>FRAME</name>
					<description>Frame Number</description>
					<addressOffset>0x70</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FRAMENUM</name>
							<description>Frame Number. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>11</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCONTROL</name>
					<description>Transceiver Control</description>
					<addressOffset>0x200</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DN</name>
							<description>D- Signal State. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOGIC_0</name>
									<description>D- signal currently at logic 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOGIC_1</name>
									<description>D- signal currently at logic 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DP</name>
							<description>D+ Signal State. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOGIC_0</name>
									<description>D+ signal currently at logic 0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOGIC_1</name>
									<description>D+ signal currently at logic 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DFREC</name>
							<description>Differential Receiver State. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIFF_0</name>
									<description>Differential 0 signalling is present on the bus.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIFF_1</name>
									<description>Differential 1 signalling is present on the bus.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PHYTST</name>
							<description>Physical Layer Test. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>MODE0</name>
									<description>Mode 0: Normal (non-test mode) (D+ = X, D- = X).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE1</name>
									<description>Mode 1: Differential 1 Forced (D+ = 1, D- = 0).</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE2</name>
									<description>Mode 2: Differential 0 Forced (D+ = 0, D- = 1).</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MODE3</name>
									<description>Mode 3: Single-Ended 0 Forced (D+ = 0, D- = 0).</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SSEL</name>
							<description>USB Speed Select. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW_SPEED</name>
									<description>USB operates as a Low Speed device. If enabled, the internal pull-up resistor appears on the D- line.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FULL_SPEED</name>
									<description>USB operates as a Full Speed device. If enabled, the internal pull-up resistor appears on the D+ line.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PHYEN</name>
							<description>Physical Layer Enable. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the USB physical layer Transceiver (suspend).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the USB physical layer Transceiver (normal).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PUEN</name>
							<description>Internal Pull-up Resistor Enable. </description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the internal pull-up resistor (device effectively detached from the USB network).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the internal pull-up resistor when VBUS is present (device is attached to the USB network).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CLKSEL</name>
					<description>Module Clock Select</description>
					<addressOffset>0x300</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CLKSEL</name>
							<description>USB Clock Select. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>USBNOSC</name>
									<description>Select the USB Oscillator as the USB clock.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PLLNOSC</name>
									<description>Select the PLL output as the USB clock.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EXTOSCN</name>
									<description>Select the External Oscillator output (EXTOSCn) as the USB clock.</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKDIV</name>
							<description>USB Clock Divider. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIV1</name>
									<description>The USB module uses the selected input clock divided by 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV2</name>
									<description>The USB module uses the selected input clock divided by 2.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV4</name>
									<description>The USB module uses the selected input clock divided by 4.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DIV8</name>
									<description>The USB module uses the selected input clock divided by 8.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESET</name>
							<description>USB Reset. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Do not reset the USB module.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Reset the USB module.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>OSCCONTROL</name>
					<description>Oscillator Control</description>
					<addressOffset>0x310</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SUSPEND</name>
							<description>USB Oscillator Suspend. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>The USB oscillator is not suspended.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Suspend the USB oscillator.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OSCEN</name>
							<description>USB Oscillator Enable. </description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the USB oscillator.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the USB oscillator.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>AFADJUST</name>
					<description>Oscillator Additional Frequency Adjust</description>
					<addressOffset>0x320</addressOffset>
					<resetValue>0x00000020</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FINEFADJ</name>
							<description>USB Oscillator Fine Output Frequency Adjust. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>DITHEN</name>
							<description>USB Oscillator Dithering Enable. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable USB oscillator dithering.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable USB oscillator dithering.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>FADJUST</name>
					<description>Oscillator Frequency Adjust</description>
					<addressOffset>0x330</addressOffset>
					<resetValue>0x00000040</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FADJ</name>
							<description>Oscillator Output Frequency Adjust. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DMAFIFO</name>
					<description>DMA Data FIFO Access</description>
					<addressOffset>0x400</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<readAction>modifyExternal</readAction>
					<fields>
						<field>
							<name>DMAFIFO</name>
							<description>DMA Data FIFO Access. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DMACONTROL</name>
					<description>DMA Control</description>
					<addressOffset>0x410</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DBGMD</name>
							<description>USB DMA Debug Mode. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>RUN</name>
									<description>The USB module will continue to operate while the core is halted in debug mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HALT</name>
									<description>A debug breakpoint will prevent the USB DMA buffer from transferring data to and from the USB FIFOs when the core is halted.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TERRF</name>
							<description>Timeout Error Flag. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>A timeout error has not occurred.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>A timeout error occurred.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DBUSYF</name>
							<description>USB DMA Busy Flag. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>The DMA buffer is not busy.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>The DMA buffer is busy reading or writing an 8-word packet.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DFIFOFL</name>
							<description>USB DMA Buffer Flush Control. </description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>SET</name>
									<description>Flush the USB DMA buffer.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
